
confirm("Запустити калькулятор?");

var res = prompt("Введіть назву оператора: [ + ], [ - ], [ * ], [ / ]");
var a = prompt("Введіть перше число:");
var b = prompt("Введіть друге число:");

//Спосіб 1 - (if)
if (res === '+'){
    alert(+a + +b +" - сума чисел");
}else if (res === '-'){
    alert(+a - +b +' - різниця чисел');
}else if (res === '*'){
    alert( +a * +b +' - добуток чисел');
}else if (res === '/' ){
    if (+b === 0){
        alert ("На нуль не ділиться");
    }else{
        alert(+a / +b + ' - частка чисел');
    }
}else{
    alert("Введено хибний оператор");
}


 /* //Спосіб 2 - (?:)

 var message = (res === '+') ?(+a + +b +" - сума чисел"):
                    (res === '-') ? (+a + +b +" - різниця чисел"):
                        (res === '*') ?(+a + +b +" - добуток чисел"):
                            (res === '/') ?(+a + +b +" - частка чисел"):
                                ("Введено хибні дані");
 alert (message);*/


   /* //Спосіб 3 - (switch)

   switch (res){
        case '+':
            alert(+a + +b +" - сума чисел");
                break;
        case '-':
            alert(+a - +b +" - різниця чисел");
                break;
        case '*':
            alert(+a * +b +" - добуток чисел");
                break;
        case '/':
            if (+b===0) alert("На нуль не ділиться");
            else alert(+a / +b +" - частка чисел");
                break;
        default:
            alert("Введено хибні дані");

    }*/